In [1]:
import numpy as np
import pandas as pd

![group](Assets\group.png)

In [3]:
df = pd.DataFrame({"key1" : ["a", "a", None, "b", "b", "a", None],
                   "key2" : pd.Series([1, 2, 1, 2, 1, None, 1], dtype="Int64"),
                            "data1" : np.random.standard_normal(7),
                            "data2" : np.random.standard_normal(7)})

In [4]:
df

   key1  key2     data1     data2
0     a     1 -0.423694  0.678053
1     a     2  2.924735 -1.942411
2  None     1  0.241657 -0.277758
3     b     2 -1.753717 -1.453078
4     b     1  0.268000  1.917446
5     a  <NA>  0.262699  0.571325
6  None     1  0.354164  1.142879

In [5]:
grouped = df['data1'].groupby(df['key1'])
grouped

In [6]:
grouped.mean()

key1
a    0.921247
b   -0.742859
Name: data1, dtype: float64

In [7]:
means = df['data1'].groupby([df['key1'], df['key2']]).mean()
means

key1  key2
a     1      -0.423694
      2       2.924735
b     1       0.268000
      2      -1.753717
Name: data1, dtype: float64

In [9]:
means

key1  key2
a     1      -0.423694
      2       2.924735
b     1       0.268000
      2      -1.753717
Name: data1, dtype: float64

In [8]:
means.unstack()

key2         1         2
key1
a    -0.423694  2.924735
b     0.268000 -1.753717

In [10]:
states = np.array(["OH", "CA", "CA", "OH", "OH", "CA", "OH"])
years = [2005, 2005, 2006, 2005, 2006, 2005, 2006]
df['data1'].groupby([states, years]).mean()

CA  2005    1.593717
    2006    0.241657
OH  2005   -1.088706
    2006    0.311082
Name: data1, dtype: float64

In [11]:
df.groupby('key1').mean()

      key2     data1     data2
key1
a      1.5  0.921247 -0.231011
b      1.5 -0.742859  0.232184

In [14]:
df.groupby(['key1', 'key2']).mean()

              data1     data2
key1 key2
a    1    -0.423694  0.678053
     2     2.924735 -1.942411
b    1     0.268000  1.917446
     2    -1.753717 -1.453078

In [15]:
df.groupby(['key1', 'key2']).size()

key1  key2
a     1       1
      2       1
b     1       1
      2       1
dtype: int64

In [16]:
df.groupby('key1', dropna=False).size()

key1
a      3
b      2
NaN    2
dtype: int64

In [19]:
df.groupby('key1').count()

      key2  data1  data2
key1
a        2      3      3
b        2      2      2

 ## Iterating over Groups

In [20]:
for name, group in df.groupby('key1'):
    print(name)
    print(group)

a
  key1  key2     data1     data2
0    a     1 -0.423694  0.678053
1    a     2  2.924735 -1.942411
5    a  <NA>  0.262699  0.571325
b
  key1  key2     data1     data2
3    b     2 -1.753717 -1.453078
4    b     1  0.268000  1.917446

In the case of multiple keys, the first element in the tuple will be a tuple of key values

In [21]:
for (k1, k2), group in df.groupby(['key1', 'key2']):
    print((k1, k2))
    print(group)

('a', 1)
  key1  key2     data1     data2
0    a     1 -0.423694  0.678053
('a', 2)
  key1  key2     data1     data2
1    a     2  2.924735 -1.942411
('b', 1)
  key1  key2  data1     data2
4    b     1  0.268  1.917446
('b', 2)
  key1  key2     data1     data2
3    b     2 -1.753717 -1.453078

A recipe
 you may find useful is computing a dictionary of the data pieces as a one-liner

In [22]:
pieces = {name: group for name, group in df.groupby('key1')}

In [24]:
pieces['a']

  key1  key2     data1     data2
0    a     1 -0.423694  0.678053
1    a     2  2.924735 -1.942411
5    a  <NA>  0.262699  0.571325

In [25]:
pieces['b']

  key1  key2     data1     data2
3    b     2 -1.753717 -1.453078
4    b     1  0.268000  1.917446

In [26]:
 grouped = df.groupby({"key1": "key", "key2": "key",
                       "data1": "data", "data2": "data"}, axis="columns")

C:\Users\ahamm\AppData\Local\Temp\ipykernel_9200\2115056569.py:1: FutureWarning: DataFrame.groupby with axis=1 is deprecated. Do `frame.T.groupby(...)` without axis instead.
  grouped = df.groupby({"key1": "key", "key2": "key",

In [27]:
for group_key, group_values in grouped:
    print(group_key)
    print(group_values)

data
      data1     data2
0 -0.423694  0.678053
1  2.924735 -1.942411
2  0.241657 -0.277758
3 -1.753717 -1.453078
4  0.268000  1.917446
5  0.262699  0.571325
6  0.354164  1.142879
key
   key1  key2
0     a     1
1     a     2
2  None     1
3     b     2
4     b     1
5     a  <NA>
6  None     1

## Selecting a Column or Subset of Columns

In [28]:
df.groupby(['key1', 'key2'])[['data2']].mean()

              data2
key1 key2
a    1     0.678053
     2    -1.942411
b    1     1.917446
     2    -1.453078

In [29]:
s_grouped = df.groupby(['key1', 'key2'])['data2']

In [30]:
s_grouped

In [31]:
s_grouped.mean()

key1  key2
a     1       0.678053
      2      -1.942411
b     1       1.917446
      2      -1.453078
Name: data2, dtype: float64

##  Grouping with Dictionaries and Series

In [32]:
people = pd.DataFrame(np.random.standard_normal((5, 5)),
                    columns=["a", "b", "c", "d", "e"],
                    index=["Joe", "Steve", "Wanda", "Jill", "Trey"])

In [33]:
people

              a         b         c         d         e
Joe   -0.056294  0.904361  0.457438 -0.283741 -0.059150
Steve -0.795369 -0.710669  0.193011  1.406449 -0.677985
Wanda  2.227521 -0.734402  0.507382  1.026955 -1.241785
Jill  -0.931229  0.197653  0.081742  1.114777 -0.224157
Trey   2.350687 -0.576619  1.035453 -0.312798  0.795518

In [36]:
people.iloc[2:3, [1, 2]] = np.nan
people

              a         b         c         d         e
Joe   -0.056294  0.904361  0.457438 -0.283741 -0.059150
Steve -0.795369 -0.710669  0.193011  1.406449 -0.677985
Wanda  2.227521       NaN       NaN  1.026955 -1.241785
Jill  -0.931229  0.197653  0.081742  1.114777 -0.224157
Trey   2.350687 -0.576619  1.035453 -0.312798  0.795518

In [37]:
 mapping = {"a": "red", "b": "red", "c": "blue",
            "d": "blue", "e": "red", "f" : "orange"}

In [40]:
by_columns = people.groupby(mapping, axis=1)
by_columns.sum()

C:\Users\ahamm\AppData\Local\Temp\ipykernel_9200\3433550516.py:1: FutureWarning: DataFrame.groupby with axis=1 is deprecated. Do `frame.T.groupby(...)` without axis instead.
  by_columns = people.groupby(mapping, axis=1)

           blue       red
Joe    0.173697  0.788916
Steve  1.599460 -2.184022
Wanda  1.026955  0.985736
Jill   1.196519 -0.957733
Trey   0.722655  2.569585

In [42]:
map_series = pd.Series(mapping)
map_series

a       red
b       red
c      blue
d      blue
e       red
f    orange
dtype: object

In [43]:
people.groupby(map_series, axis=1).count()

C:\Users\ahamm\AppData\Local\Temp\ipykernel_9200\1833935060.py:1: FutureWarning: DataFrame.groupby with axis=1 is deprecated. Do `frame.T.groupby(...)` without axis instead.
  people.groupby(map_series, axis=1).count()

       blue  red
Joe       2    3
Steve     2    3
Wanda     1    2
Jill      2    3
Trey      2    3

## Grouping with Functions

In [44]:
people.groupby(len).sum()

          a         b         c         d         e
3 -0.056294  0.904361  0.457438 -0.283741 -0.059150
4  1.419457 -0.378966  1.117195  0.801980  0.571361
5  1.432152 -0.710669  0.193011  2.433404 -1.919770

In [45]:
key_list = ["one", "one", "one", "two", "two"]
people.groupby([len, key_list]).min()

              a         b         c         d         e
3 one -0.056294  0.904361  0.457438 -0.283741 -0.059150
4 two -0.931229 -0.576619  0.081742 -0.312798 -0.224157
5 one -0.795369 -0.710669  0.193011  1.026955 -1.241785

## Grouping by Index Levels

In [47]:
columns = pd.MultiIndex.from_arrays([["US", "US", "US", "JP", "JP"],                                  
[1, 3, 5, 1, 3]],                                  
names=["cty", "tenor"])

In [48]:
columns

MultiIndex([('US', 1),
            ('US', 3),
            ('US', 5),
            ('JP', 1),
            ('JP', 3)],
           names=['cty', 'tenor'])

In [49]:
hier_df = pd.DataFrame(np.random.standard_normal((4,5)), 
                      columns=columns)

In [50]:
hier_df

cty          US                            JP
tenor         1         3         5         1         3
0     -0.044752  0.645718 -1.577740 -0.029086 -0.658792
1     -0.531403  1.515731 -0.987938 -2.351433 -0.739966
2      0.936765 -1.734393 -0.706418  0.166409 -0.882235
3      0.186049 -0.357696 -0.644074  1.322451 -1.117615

In [52]:
hier_df.groupby(level="tenor", axis="columns").count()

C:\Users\ahamm\AppData\Local\Temp\ipykernel_9200\1243420512.py:1: FutureWarning: DataFrame.groupby with axis=1 is deprecated. Do `frame.T.groupby(...)` without axis instead.
  hier_df.groupby(level="tenor", axis="columns").count()

tenor  1  3  5
0      2  2  1
1      2  2  1
2      2  2  1
3      2  2  1

## Data Aggregation

![agg](Assets\agg.png)
![agg](Assets\agg1.png)

In [53]:
df

   key1  key2     data1     data2
0     a     1 -0.423694  0.678053
1     a     2  2.924735 -1.942411
2  None     1  0.241657 -0.277758
3     b     2 -1.753717 -1.453078
4     b     1  0.268000  1.917446
5     a  <NA>  0.262699  0.571325
6  None     1  0.354164  1.142879

In [56]:
def peak_to_peak(arr):
    return arr.max() - arr.min()
grouped = df.groupby("key1")
grouped.agg(peak_to_peak)

      key2     data1     data2
key1
a        1  3.348429  2.620464
b        1  2.021717  3.370524

In [57]:
grouped.describe()

      key2                                           data1            ...  \
     count mean       std  min   25%  50%   75%  max count      mean  ...
key1                                                                  ...
a      2.0  1.5  0.707107  1.0  1.25  1.5  1.75  2.0   3.0  0.921247  ...
b      2.0  1.5  0.707107  1.0  1.25  1.5  1.75  2.0   2.0 -0.742859  ...

                         data2                                          \
           75%       max count      mean       std       min       25%
key1
a     1.593717  2.924735   3.0 -0.231011  1.483076 -1.942411 -0.685543
b    -0.237429  0.268000   2.0  0.232184  2.383320 -1.453078 -0.610447


           50%       75%       max
key1
a     0.571325  0.624689  0.678053
b     0.232184  1.074815  1.917446

[2 rows x 24 columns]

In [58]:
grouped.mean()

      key2     data1     data2
key1
a      1.5  0.921247 -0.231011
b      1.5 -0.742859  0.232184

In [59]:
grouped['data1'].sum()

key1
a    2.763741
b   -1.485717
Name: data1, dtype: float64

## Column-Wise and Multiple Function Application

In [60]:
tips = pd.read_csv("examples/tips.csv")

In [61]:
tips.head()

   total_bill   tip smoker  day    time  size
0       16.99  1.01     No  Sun  Dinner     2
1       10.34  1.66     No  Sun  Dinner     3
2       21.01  3.50     No  Sun  Dinner     3
3       23.68  3.31     No  Sun  Dinner     2
4       24.59  3.61     No  Sun  Dinner     4

In [62]:
tips['tip_pct'] = tips['tip'] / tips['total_bill']

In [63]:
tips.head()

   total_bill   tip smoker  day    time  size   tip_pct
0       16.99  1.01     No  Sun  Dinner     2  0.059447
1       10.34  1.66     No  Sun  Dinner     3  0.160542
2       21.01  3.50     No  Sun  Dinner     3  0.166587
3       23.68  3.31     No  Sun  Dinner     2  0.139780
4       24.59  3.61     No  Sun  Dinner     4  0.146808

In [64]:
grouped = tips.groupby(['day', 'smoker'])

In [65]:
grouped_pct = grouped['tip_pct']

In [66]:
grouped_pct.agg('mean')

day   smoker
Fri   No        0.151650
      Yes       0.174783
Sat   No        0.158048
      Yes       0.147906
Sun   No        0.160113
      Yes       0.187250
Thur  No        0.160298
      Yes       0.163863
Name: tip_pct, dtype: float64

In [67]:
grouped_pct.agg(["mean", "std", peak_to_peak])

                 mean       std  peak_to_peak
day  smoker
Fri  No      0.151650  0.028123      0.067349
     Yes     0.174783  0.051293      0.159925
Sat  No      0.158048  0.039767      0.235193
     Yes     0.147906  0.061375      0.290095
Sun  No      0.160113  0.042347      0.193226
     Yes     0.187250  0.154134      0.644685
Thur No      0.160298  0.038774      0.193350
     Yes     0.163863  0.039389      0.151240